words = [
 "``` 	劇的に優れたプロダクトを生み出すのに必要なのは巨大な組織ではなく、数えきれないほどの試行錯誤を繰り返すことだ	```	How Google Works	,
"``` 	あらゆる可能性にオープンだ。自由に他者と協力し、アイデアや分析をそれを誰が口にしたかではなく、それ自体の質にもとづいて評価する	```	How Google Works	,
"``` 	全員に共通するのは、ビジネスセンス、専門知識、クリエイティブなエネルギー、自分で手を動かして業務を遂行しようとする姿勢だ。これが基本的要件だ	```	How Google Works	,
"``` 	「本当に大切なのは、すべてわかったと思った後に学ぶことだ」―ジョン・ウッデン	```	How Google Works	,
"``` 	完璧な組織デザインなど存在しないのだから、それを探そうとするのはムダだ。できるだけそれに近いものができたら、あとは社内のスマート・クリエイティブに任せればいい	```	How Google Works	,
"``` 	アマゾン創業者のジェフ・ベゾスはかつて「ピザ二枚のルール」を提唱していた。一つのチームは、ピザ二枚で足りるぐらいの規模にとどめなければならない、という意味だ	```	How Google Works	,
"``` 	マネジャーは肩書がつくる。リーダーはまわりの人間がつくる	```	How Google Works	,
"``` 	やるべき仕事があれば、忙しい人に任せろ	```	How Google Works	,
"``` 	「燃え尽き症候群の原因は働きすぎではなく、自分にとって本当に大切なことを諦めなければならなくなったときに起こる」―マリッサ・メイヤー	```	How Google Works	,
"``` 	楽しい理由の一つは、将来の成功の予感かもしれない。だが、一番大きいのは、同僚と一緒に笑ったり、ジョークを言いあったり、ともに仕事をすることの楽しさであるはずだ	```	How Google Works	,
"``` 	グーグルのオフサイト・ミーティングに関する考え方は、「チームビルディングは忘れて、思い切り楽しむ」というものだ	```	How Google Works	,
"``` 	楽しさはあらゆるところから生まれてくる。重要なのは「許されること」の境界をできるだけ広げておくことだ	```	How Google Works	,
"``` 	大切なのは顧客の要望に応えることより、顧客が思いつかないような、あるいは解決できないと思っていた問題へのソリューションを提供することだ	```	How Google Works	,
"``` 	技術的アイデアを見つけるもう一つの方法は、小さな問題の解決策に注目し、その適用範囲を広げる方法を考えることだ	```	How Google Works	,
"``` 	優れた企業の基礎とは、いずれ収益を生み出すためのしっかりとした素地を整えるものでなければならない	```	How Google Works	,
"``` 	情熱家が話を始めたら、とにかく真剣に聞こう。とくに「情熱を追求するスタイル」に注意を払うのだ	```	How Google Works	,
"``` 	大切なのは優秀な人が「何を知っているか」ではなく、「これから何を学ぶか」だ	```	How Google Works	,
"``` 	自分の能力は変わらないと考えていると、その自己イメージを維持するために「到達目標」を設定する。一方、しなやかマインドセットの持ち主は「学習目標」を設定する。学ぶこと自体が目標になると、くだらない質問をしたり、答えを間違えたりしたら自分がバカに見えるのではないかなどと悩んだりせず、リスクをとるようになる	```	How Google Works	,
"``` 	あなたがリスクをとり、彼らに新しい職務への挑戦を促せば、優れた人材を獲得できるだろう。彼らがあなたの会社を選ぶ理由は、あなたがリスクをとる姿勢を見せたからにほかならない	```	How Google Works	,
"``` 	応募者のバックグラウンドについて聞くときには、単なる過去の経験談ではなく、「そこから何を学んだか」を説明させよう。履歴書をなぞるだけでなく、応募者に思考能力をアピールさせよう。「何に驚きを感じましたか？」というのは、うまい聞き方だ。よくある質問ではないので、用意してきた答えは使えない。応募者は自分の経験を、これまでとは違った目で振り返らなければならない	```	How Google Works	,
"``` 	良い質問をする人は、好奇心が旺盛で、頭がよく、柔軟でおもしろく、自分がすべての答えを知っているわけではないことをわかっている	```	How Google Works	,
"``` 	判断に到達するプロセス、タイミング、そして判断を実行に移す方法も、判断の内容そのものと同じくらい重要なのだ	```	How Google Works	,
"``` 	「問題をきちんと述べられれば、半分解けたようなものだ」―ジョン・デューイ	```	How Google Works	,
"``` 	事例の複数形はデータである	```	How Google Works	,
"``` 	コンセンサスとは全員にイエスと言わせることではなく、会社にとって最適解を共に考え、その下に結集することなのだ	```	How Google Works	,
"``` 	正しいコンセンサス・プロセスには「包含（すべての利害関係者に参加させる）」「協力（ときには少数意見や個人の主張を犠牲にしても、グループ全体にとって最適な決定を目指す）」「平等（すべての参加者が同じように大切で、反対意見を述べることが認められる）」の要素がそろっている	```	How Google Works	,
"``` 	正しい判断とは最高の判断であって、全員が納得できる最低限の妥協案ではない。そしてあなた自身が最適と思うソリューションとも限らない	```	How Google Works	,
"``` 	行動志向は、実践的で試行錯誤をいとわない考え方である。ある行動をとることが正しいか確信が持てないなら、一番いいのは実際にやってみて、結果に応じて軌道修正することだ	```	How Google Works	,
"``` 	会議の結果を知らせるべき人が他にもいるなら、オブザーバーとして参加させるより、情報共有のプロセスをつくるほうがいい。オブザーバーがいると、参加者が率直に意見を言いにくくなる	```	How Google Works	,
"``` 	力の源泉は秘匿した情報ではなく、共有した情報だ。企業の価値観や報酬システムに、この考え方を反映させる必要がある	```	How Google Works	,
"``` 	良い知らせは次の日もあまり変わらないが、悪い知らせは日を追うごとにさらに悪くなっていく	```	How Google Works	,
"``` 	パイロットは緊急事態に陥ったとき、まず上昇せよ、と教わる。危険から逃れるのだ。次に告白、つまり管制塔と連絡をとり、自分がどのようなトラブル状態にあるかを説明する。最後に順守だ。管制塔にどうすればよいか指示されたら、そのとおりにやるのだ	```	How Google Works	,
"``` 	顧客に要求どおりのモノを提供するのは、革新的とは言わない。単に反応が良いだけだ	```	How Google Works	,
"``` 	イノベーティブな人材に、イノベーションを起こせと言う必要はない。そうする自由さえ与えればいい	```	How Google Works	,
"``` 	楽観主義はイノベーションに欠かせない要素だ。それがなかったら安定より変化を、安全な場所より冒険を選ぶ理由があるだろう	```	How Google Works	,
"``` 	新しいアイデアを思いつくだけの頭の良さと、それがうまくいくはずだと考えるだけの頭のおかしさを持ち合わせた人材を採用しよう	```	How Google Works	,
"``` 	ベストセラーになったナシム・タレブ教授は「抗脆弱性」を持つシステムをつくれと説く。失敗や外的ショックに耐えられるだけでなく、それを糧にさらに強くなるようなシステムだ。誤解のないように言っておくと、失敗自体が目的ではない。だがイノベーション環境の健全性を測るうえでは、成功だけでなく失敗の数も重要だ。失敗を重ねることで抗脆弱性が高まる。	```	How Google Works
]

module.exports = (robot) ->
  robot.hear /(いい言葉)/i, (msg) ->
    shuzo = msg.random words
    msg.send "#{shuzo}"